# parameters
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple

# yolov5 backbone
backbone:
  # [from, number, module, args]  448,448,3
  [[-1, 1, Focus, [64, 3]],  #224,224,32
   [-1, 1, DWConv, [64, 3, 1]],  #112,112,32
   [-1, 1, Conv, [64, 1, 1]],  #112,112,128
   [-1, 1, DWConv, [64, 3, 1]],
   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, DWConv, [64, 3, 1]],
   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, DWConv, [64, 3, 1]],
   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, DWConv, [64, 3, 1]],
   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, DWConv, [64, 3, 1]],
   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, DWConv, [64, 3, 1]],
   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, DWConv, [64, 3, 1]],
   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, DWConv, [32, 3, 1]],
   [-1, 1, Conv, [32, 1, 1]],
   [-1, 1, DWConv, [16, 3, 1]],
   [-1, 1, Conv, [16, 1, 1]],
   [-1, 1, DWConv, [8, 3, 1]],
   [-1, 1, Conv, [8, 1, 1]],
   [-1, 1, DWConv, [4, 3, 1]],
   [-1, 1, Conv, [4, 1, 1]],
   [-1, 1, DWConv, [4, 3, 1]],
   [-1, 1, Conv, [4, 1, 1]],
  ]
classify:
  [
    #[from,number,module,args]
    [-1, 1, nn.AdaptiveAvgPool2d, [1]],
    [-1, 1, FC,[4]]
    #crossentropyloss自带softmax
    #[-1, 1, nn.Softmax,[1]]
  ]